html/intro/intro.html
<!doctype html>
<html lang="en">
<head>
<title>Introduction</title>
<!-- 2024-03-20 Wed 17:31 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Basic Notations</a></li>
<li><a href="#sec-2">2. Little&rsquo;s Law</a></li>
<li><a href="#sec-3">3. Utilization Law</a></li>
<li><a href="#sec-4">4. PASTA property</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Introduction</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Basic Notations</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>\(R\) <b>= Response Time</b> [in seconds], where \(R = W + \mu^{-1}\) (Waiting time +
Service time)
</li>
<li>\(\mu^{-1}\) <b>= Service Time</b> [in seconds] (time interval in which the server
starts to serve)
</li>
<li>\(W\) <b>= Waiting Time</b> [in seconds] (time interval in which the job waits in the
queue)
</li>
<li>\(\lambda\) <b>= Arrival Rate</b> [jobs/second] (this is the rate at which customers
arrive for service)
</li>
<li>\(X\) <b>= Throughput</b> [jobs/second] (the amount of jobs the system is serving at
a specific moment, it depends on the traffic)
</li>
<li>\(U\) <b>= Utilization</b> of the server \([0, 1]\) (the portion of resources actually
in use)
</li>
<li>\(N\) <b>= Occupancy</b> of the server (total jobs in a system), where \(N =
  N_{s}+N_{w}\) (sum between jobs in service and jobs waiting in the queue)
</li>
<li>\(P\) <b>= Power consumption</b> \([W]\)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Little&rsquo;s Law</h2>
<div class="outline-text-2" id="text-2">
<p>
It shows how the three major queuing metrics—throughput, response time, and
queuing length—correlate with each other. This is a generic law that has no
assumptions attached to it other than the equilibrium condition, which means
that no customers are created or lost in the system. Little’s law has been
widely applied to solving software performance and scalability problems.
</p>

<blockquote>
<p>
<b>Little&rsquo;s Law</b>: the number of jobs (on average), both waiting for and receiving
service, is equal to the product of throughput and response time.
\[\overline{N}=X*\overline{R}\] This relation holds under the condition of
system stability, i.e. \(\lambda < \mu\).
</p>

<p>
Since response time can be expressed as \(R=W+\mu^{-1}\) in general, where W
represents wait time and S service time, we can further decompose the equation
into: \[N_{waiting}=X*W\] \[N_{serviced}=X*\mu^{-1}\]
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Utilization Law</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
Utilization Law for single-server systems:
\[U=\frac{\lambda}{\mu}=\frac{X}{\mu}\]
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> PASTA property</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
The PASTA property refers to the expected state of a queueing system as seen by
an arrival from a Poisson process. <b>An arrival from a Poisson process observes the
system as if it was arriving at a random moment in time</b>. Therefore, the expected
value of any parameter of the queue at the instant of a Poisson arrival is
simply the long-run average value of that parameter.
</p>
</blockquote>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2024-03-20 Wed 17:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="http://orgmode.org">Org-mode</a> 9.7)</p>
</div>
</footer>
</body>
</html>
